app/controllers/student2s_controller.rb

SELECT "student2s".* FROM "student2s"
---
  def index
    @student2s = Student2.all